export const commentListMock = [
  {
    id: "111",
    mainRateValue: 4,
    createdTime: new Date() - 60 * 60 * 2 * 1000,
    userName: "吕布",
    content:
      "吕布（151年10月5日－199年2月7日），字奉先，五原郡九原县人。刘备称吕布为兄长，吕布称刘备为贤弟，可见出生日期早于刘备。《三国演义》里因先后为丁原、董卓的部将，并将其杀死。吕布膂力过人，号称“飞将”，因其外表华美，并有坐骑赤兔马，被称为“人中吕布，马中赤兔”。曹操的一句“吕布非一人可胜”更是奠定了吕布武艺在三国前期无人可胜。虎牢关前大战关羽、张飞联手不落下风，最后因刘备助战抵挡不住而撤退，而后在濮阳与曹操的战斗中大战许褚和典韦依然不落下风，最后六将齐攻亦能全身而退，三国前期武力数一数二，无愧于三国前期数一数二猛将的称号！最后因被酒所伤又被部下叛变盗走赤兔马和方天画戟被曹操擒杀，终年48岁。兴平元年（194年），吕布趁曹操攻打陶谦时与陈宫等联络而进入兖州，占据濮阳，与曹操血战两年，曾使曹操数战不利，但最终被曹操击败转而去依附徐州刘备。又趁刘备与袁术作战时袭取了徐州，与刘备时而和好，时而相互攻伐。期间，以辕门射戟化解刘备与纪灵的争斗。建安三年（198年），吕布先后击败刘备与夏侯惇[dūn]后，曹操亲自出马征讨吕布，水淹下邳。吕布被部下叛变，于十二月癸酉（199年2月7日）城破被俘，被处死。兴平元年（194年），曹操向东攻打陶谦，派将领武阳人陈宫驻守东郡。陈宫趁机劝说张邈：“现在天下分裂，英雄豪杰同时嵋起，您拥有十万人的队伍，处在可以四面作战的地方，按剑雄视天下，是可以做人中豪杰，反而被人控制，不是太卑下了吗？现在本州的军队东征，其地空虚，吕布是猛士，善于作战，英勇无敌，将他接来一同占据兖州，观望天下形势，等候时事的变化好转，这可以纵横一世。”张邈听从陈宫的意见，就同弟弟张超和陈宫等人迎接吕布，请他当兖州牧，占据濮阳，兖州所属郡县一同响应。曹操知道后率领军队攻打吕布，濮阳大姓田氏在城里响应曹操，曹操趁机入城后，放火烧东城门，来激励将士与吕布决一死战。吕布则先派骑兵冲散青州兵，导致曹军阵势大乱，吕布手下骑将抓到曹操问他曹操在哪儿，曹操说骑黄马的那个就是。于是吕布追击骑黄马的人，而放走了曹操。 [13]  曹操策马冒火突围，烧伤了左掌。 [14]  此后双方多次交战，相持一百多天。这时发生天旱，又有蝗虫为害，粮食不够，出现了人吃人。吕布将部队移到山阳驻扎。",
    children: [
      {
        id: "1-111",
        chilRateValue: 4.1,
        createdTime: "2020-09-01",
        userName: "赵云",
        content:
          "赵云（约154年－229年），字子龙，常山真定人。在《三国演义》里与文丑大战六十回合未分胜负，沦为游侠时挑死黄巾余党裴元绍，汝南时为救刘备偷袭高览，又三十合击退张郃，刘备与曹操对阵时曾经与许褚对战三十回合不分胜负。救出刘备之子刘禅。孙权听从张昭的计谋谎称吴国太病重，趁机绑架刘禅换回荆州，赵云知道后单枪匹马追了上去，后来张飞赶到，二人向孙夫人要回了刘禅。在汉中之战，勇救被曹操大军围困的黄忠，吓得徐晃与张郃不敢接战。在北伐时，年已七旬的子龙老将军连斩韩德父子五人，与姜维战数个回合。是五虎上将中唯一的两朝元老。赵云跟随刘备将近三十年，先后参加过博望坡之战、长坂坡之战、江南平定战，独自指挥过入川之战、汉水之战、箕谷之战，都取得了非常好的战果。除了四处征战，赵云还先后以偏将军任桂阳太守，以留营司马留守公安，以翊军将军督江州。除此之外，赵云于平定益州时引霍去病故事劝谏刘备将田宅归还百姓，又于关羽、张飞被害之后劝谏刘备不要伐吴，被后世赞为有大臣局量的儒将，甚至被认为是三国时期的完美人物 。建安二十四年（公元219年）正月，刘备听从法正、黄权等人的建议进攻汉中，汉中守将夏侯渊被黄忠所斩。三月，曹操亲自率领大军来争夺汉中，并运送大量的军粮到北山下，有数千万袋，黄忠认为可趁机夺取这些军粮，赵云于是授予黄忠兵力去取北山。但是黄忠约定的时间之后仍未回来，赵云便带着数十骑出了营寨，查看黄忠等人的情况。恰巧遇到曹操派出的大军，赵云遭到曹军先锋部队的攻击，刚与敌人交手，曹操的大军已来到面前，声势逼人。赵云便一次又一次地突击曹军阵列，且战且退。曹军散而复合，赵云突围而出并退入汉军的营寨内，此时部将张著受伤，又被曹军包围，赵云又一次驰马突击曹军，并救出张著，将他带回营寨内。此时曹军已追至汉军的营寨前，沔阳长张翼正在防守营寨，见曹操大军杀到，便要闭门拒守。赵云进入大营之后，却下令大开营门，然后令汉军偃旗息鼓。曹军见此情况，怀疑赵云设有伏兵，便向后退去。此时赵云下令鸣击战鼓，鼓声震天，又令军士以弩箭射曹军，曹军惊骇，自相蹂践，坠入汉水中淹死者甚多。次日刘备亲自来到赵云兵营察看昨日战斗之处，赞叹说：“子龙一身都是胆也！”于是设宴欢庆直到黄昏，军中称呼赵云为“虎威将军”。",
      },
      {
        id: "1-112",
        chilRateValue: 2,
        createdTime: "2020-09-02",
        userName: "典韦",
        content:
          "典韦（？－197年），陈留己吾人。被称为古之恶来，曾与许褚大战不分胜负，能逐虎过涧，被胡车儿偷走武器双戟，被反叛的张绣军所杀，死时大概三十多岁。",
      },
      {
        id: "1-113",
        chilRateValue: 3.1,
        createdTime: new Date(),
        userName: "关羽",
        content:
          "关羽（162年－220年），字云长，河东郡解县人（160年）六月二十四日”，崇帧二年（1629年）立于石磐沟关羽祖茔的《祀田碑记》和清乾隆二十一年（1756年）编修的《关帝志》，都认为关羽生于汉桓帝延熹三年（160年）六月二十二日。）。是五虎上将之首，《三国演义》里出场时便与张飞各斩一名黄巾将领，而后在汜水关温酒斩华雄，虎牢关助张飞战吕布，在曹操麾下时，于白马坡连杀袁绍大将颜良、文丑。随刘备攻长沙时，与黄忠大战，用拖刀计将黄忠打败。襄樊之战与庞德战平，却被庞德用毒箭暗算，以至于后来与徐晃大战时右臂少力难以取胜。公元220年，关羽兵败被孙权杀害，时年58岁。",
      },
      {
        id: "1-114",
        chilRateValue: 4,
        createdTime: new Date(),
        userName: "马超",
        content:
          "马超（176年－222年），字孟起，司隶部扶风郡茂陵人，出生于凉州，西凉马腾之子，伏波将军马援之后，世代为凉州豪族并有爵位。《三国演义》里出场时年仅17岁，连杀李傕部下将领王方、李蒙。潼关之战时八九回合败于禁，二十回合败张郃，数合中刺死李通，又与虎痴许褚大战两百余合，杀的许褚裸衣卸甲，以一敌八杀死杨阜兄弟七人，杨阜身中五枪逃跑，连曹洪、夏侯渊夹攻，都被马超碾压。葭萌关之战时又与逸以待劳的张飞大战两百余合不分胜负，杀的张飞丢盔裹巾，两次刘备恐张飞有失。《三国演义》中被曹操、张松等誉为“不减吕布之勇”！人称“锦马超”。后归顺刘备，蜀汉建立后被封为五虎上将，镇守西平关，令五路伐蜀的羌兵不战自退，羌人奉其为“神威天将军”。公元223年病死，时年47岁，谥号“威侯”。",
      },
      {
        id: "1-115",
        chilRateValue: 3,
        createdTime: new Date(),
        userName: "张飞",
        content:
          "张飞（166年－221年），字翼德，幽州涿郡人，《三国演义》里于虎牢关与吕布打的难解难分，而后在徐州时和吕布不分胜负，刘备担心张飞，而后鸣金收兵。入川时轻松打败蜀将严颜，先后与马超、许褚大战几百回合不分胜负，曾经一次将醉酒的许褚打伤。后来被张达，范强暗算而死，终年55岁。",
      },
      {
        id: "1-116",
        chilRateValue: 2.5,
        createdTime: new Date(),
        userName: "黄忠",
        content:
          "黄忠（145年－220年），字汉升，南阳人。是五虎上将中最年长的一位将军。他是老当益壮的代表人物，《三国演义》里曾在长沙之战与关羽大战百余回合，未分胜负；汉中之战时又与夏侯渊战过数十个回合，亦未分胜负，后在法正的建议下，黄忠占领定军山，居高临下将夏侯渊斩杀。随刘备伐吴时，被东吴潘璋等人联合围攻，受伤而死（历史上在此前病死），享年75岁。",
      },
      {
        id: "1-117",
        chilRateValue: 4.5,
        createdTime: new Date(),
        userName: "许褚",
        content:
          "许褚（？－ 227年），字仲康，谯国谯人。是曹操的一员猛将。在《三国演义》里，曾经与张飞、马超、典韦、赵云等大战都没有分出胜负，仅一次醉酒时被张飞打伤。",
      },
      {
        id: "1-118",
        chilRateValue: 4.1,
        createdTime: new Date(),
        userName: "孙策",
        content:
          "孙策（175年—200年），字伯符，吴郡富春（今浙江富阳）人。孙坚长子，孙权长兄。东汉末年割据江东一带的军阀，汉末群雄之一，三国时期孙吴的奠基者之一，与周公瑾周瑜是好友，二人分别娶了江东美女大乔和小乔。《三国演义》中绰号“小霸王”。为继承父亲孙坚的遗业而屈事袁术，后脱离袁术，统一江东。在一次狩猎中为刺客所伤，不久后身亡，年仅26岁。其弟孙权接掌孙策势力，并于称帝后，追谥孙策为长沙桓王。",
      },
      {
        id: "1-119",
        chilRateValue: 3,
        createdTime: new Date(),
        userName: "邓艾",
        content:
          "邓艾（约197年－264年），字士载，义阳棘阳（今河南新野）人。三国时期魏国杰出的军事家、将领。其人文武全才，深谙兵法，对内政也颇有建树。本名邓范，后因与同乡人同名而改名。邓艾多年在曹魏西边战线防备蜀汉姜维。公元263年他与钟会分别率军攻打蜀汉，最后他率先进入成都，使得蜀汉灭亡。后因遭到钟会的污蔑和陷害，被司马昭猜忌而被收押，最后与其子邓忠一起被卫瓘派遣的武将田续所杀害。泰始九年（273年），邓艾被平反昭雪。",
      },
      {
        id: "1-120",
        chilRateValue: 3.5,
        createdTime: new Date(),
        userName: "姜维",
        content:
          "姜维（202年－264年），字伯约，天水冀县（今甘肃甘谷东南）人。三国时蜀汉名将，官至大将军。少年时和母亲住在一起，喜欢儒家大师郑玄的学说。因为父亲姜冏战死，姜维被郡里任命为中郎。诸葛亮北伐时，姜维被怀疑有异心，姜维不得已投降蜀汉，被诸葛亮重用。诸葛亮去世后姜维在蜀汉开始崭露头角，费祎死后姜维开始独掌军权，继续率领蜀汉军队北伐曹魏，与曹魏名将邓艾、陈泰、郭淮等多次交手，互有胜负。而后蜀中大臣大多反对姜维北伐，宦官黄皓也操弄权柄，姜维杀黄皓不成，前往沓中屯田避祸，后司马昭五道伐蜀，姜维摆脱牵制自己的邓艾等人，退守剑阁，阻挡住钟会大军，但邓艾却从阴平偷袭成都，刘禅投降后敕令姜维向魏军投降。后姜维希望凭自己的力量复兴蜀汉，假意投降魏将钟会，打算利用钟会反叛曹魏以实现恢复汉室的愿望，但最终钟会反叛失败，姜维与钟会一同被魏军所杀。",
      },
    ],
  },
  {
    id: "222",
    mainRateValue: 4.5,
    createdTime: new Date() - 60 * 60 * 71 * 1000,
    userName: "太史慈",
    content:
      "太史慈（166年－206年），字子义，东莱黄县（今山东龙口东黄城集）人。东汉末年名将，官至建昌都尉。弓马熟练，箭法精良。原为刘繇部下，后被孙策收降，自此太史慈为孙氏大将，助其扫荡江东。孙权统事后，因太史慈能制刘磐，便将管理南方的要务委托给他。建安十一年（206年）太史慈逝世，死前说道：“丈夫生世，当带三尺之剑，以升天子之阶。今所志未从，奈何而死乎！”（《吴书》，《三国演义》为“大丈夫生于乱世，当带三尺剑立不世之功；今所志未遂，奈何死乎！”）言讫而亡，年仅41岁。",
    children: [
      {
        id: "2-222",
        chilRateValue: 3.1,
        createdTime: new Date(),
        userName: "夏侯惇",
        content:
          "夏侯惇（？－220年），字元让，沛国谯（今安徽亳州）人。东汉末年名将，曹魏开国元勋，西汉开国元勋夏侯婴的后代。少年时以勇气闻名于乡里。曹操起兵，夏侯惇是其最早的将领之一。多次为曹操镇守后方，曾率军民阻断太寿河水，筑陂塘灌溉农田，使百姓受益，功勋卓著。历任折冲校尉、济阴太守、建武将军，官至大将军，封高安乡侯，追谥忠侯。青龙元年（233年），得以配享太祖（曹操）庙庭。夏侯惇一生虽多在军旅，但仍不忘治学。他常亲自迎师，虚心求教。他为人俭朴，所得赏赐全部分给将士。一生不置产业，至死家无余财。",
      },
    ],
  },
];
